<?php

namespace App;

class Data {
    static $ars = [
        'ب' =>
            [ 1, 'b', ],
        'ت' =>
            [ 1, 't', ],
        'ث' =>
            [ 1, 'ts',],
        'ج' =>
            [ 1, 'j', ],
        'ح' =>
            [ 1, 'h', ],
        'خ' =>
            [ 1, 'kh',],
        'د' =>
            [ 1, 'd', ],
        'ذ' =>
            [ 1, 'dz',],
        'ر' =>
            [ 1, 'r',],
        'ز' =>
            [ 1, 'z',],
        'س' =>
            [ 1, 's',],
        'ش' =>
            [ 1, 'sy',],
        'ص' =>
            [ 1, 'sh',],
        'ض' =>
            [ 1, 'dh',],
        'ط' =>
            [ 1, 'T',],
        'ظ' =>
            [ 1, 'dz',],
        'ع' =>
            [ 1, "'",],
        'غ' =>
            [ 1, 'g',],
        'ف' =>
            [ 1, 'f',],
        'ق' =>
            [ 1, 'q',],
        'ك' =>
            [ 1, 'k',],
        'ل' =>
            [ 1, 'l',],
        'م' =>
            [ 1, 'm',],
        'ن' =>
            [ 1, 'n',],
        'ه' =>
            [ 1, 'H',],
        'و' =>
            [ 1, 'w',],
        'ي' =>
            [ 1, 'y',],
        'ة' =>
            [ 1, 'Ht',],
        'ٓ' =>
            [ 2, 'x',],
        'َ' =>
            [ 2, 'a',],
        'ٰ' =>
            [ 2, 'aa',],
        'ِ' =>
            [ 2, 'i',],
        'ُ' =>
            [ 2, 'u',],
        'ً' =>
            [ 2, 'an',],
        'ٍ' =>
            [ 2, 'in',],
        'ٌ' =>
            [ 2, 'un',],
        'ّ' =>
            [ 3, '',],
        'أ' =>
            [ 4, "", 'a', "'"],
        'إ' =>
            [ 4, "", 'i', "'"],
        'ئ' =>
            [ 4, "", 'i', "'"],
        'ؤ' =>
            [ 4, "", 'u', "'"],
        'ء' =>
            [ 4, "", "", "'", ],
        'ا' =>
            [ 5, '', 'a', "'"],
        'ى' =>
            [ 5, "", "a", ""],
        'ْ' =>
            [ 7, ],
    ];
    
    static $suras = [
        "اَلْفَاتِحَة" => "al fatiHah",
        "اَلْبَقَرَة" => "al baqarah",
        "اَلِ عِمْرَان" => "ali 'imraan",
        "اَلنِّسَاء" => "an nisa'",
        "اَلْمَائِدَة" => "al maidah",
        "اَلْأَنْعَام" => "al an'am",
        "اَلْأَعْرَاف" => "al a'raf",
        "اَلْأَنْفَال" => "al anfal",
        "اَلتَّوْبَة" => "at tawbah",
        "يُونُس" => "yuunus",
        "هُود" => "huud",
        "يُوسُف" => "yuusuf",
        "اَلرَّعْد" => "ar ra'd",
        "اِبْرَاهِيم" => "ibraahiim",
        "اَلْحِجْر" => "al Hijr",
        "اَلنَّحْل" => "an naHl",
        "اَلْإِسْرَاء" => "al isra'",
        "اَلْكَهْف" => "al kahf",
        "مَرْيَم" => "maryam",
        "طَهَ" => "thaha",
        "اَلْأَنْبِيَاء" => "al anbiya'",
        "اَلْحَج" => "al Haj",
        "اَلْمُؤْمِنُون" => "al mu'minuun",
        "اَلنُّور" => "an nuur",
        "اَلْفُرْقَان" => "al furqan",
        "اَلشُّعَرَاء" => "asy syu'ara'",
        "اَلنَّمْل" => "an naml",
        "اَلْقَصَص" => "al qashash",
        "اَلْعَنْكَبُوت" => "al 'ankabuut",
        "اَلرُّوم" => "ar ruum",
        "لُقْمَان" => "luqman",
        "اَلسَّجْدَة" => "as sajdah",
        "اَلْأَحْزَاب" => "al aHzab",
        "سَبَإ" => "saba'",
        "فَاطِر" => "faathir",
        "يَس" => "yasin",
        "اَلصَّافَّات" => "as shaffat",
        "ص" => "shad",
        "اَلزُّمَر" => "az zumar",
        "غَافِر" => "ghaafir",
        "فُصِّلَت" => "fushshilat",
        "اَلشُّورَى" => "asy syuuraa",
        "اَلزُّخْرُف" => "az zukhruf",
        "اَلدُّخَان" => "ad dukhan",
        "اَلْجَاثِيَة" => "al jatsiyah",
        "اَلْأَحْقَاف" => "al aHqaf",
        "مُحَمَّد" => "muHammad",
        "اَلْفَتْح" => "al fatH",
        "اَلْحُجُرَات" => "al Hujurat",
        "ق" => "qaf",
        "اَلذَّارِيَات" => "adz dzariyat",
        "اَلطُّور" => "at thuur",
        "اَلنَّجْم" => "an najm",
        "اَلْقَمَر" => "al qamar",
        "اَلرَّحْمَن" => "ar raHman",
        "اَلْوَاقِعَة" => "al waqi'ah",
        "اَلْحَدِيد" => "al Hadiid",
        "اَلْمُجَادِلَة" => "al mujaadilah",
        "اَلْحَشْر" => "al Hasyr",
        "اَلْمُمْتَحَنَة" => "al mumtaHanah",
        "اَلصَّف" => "ash shaf",
        "اَلْجُمُعَة" => "al jumu'ah",
        "اَلْمُنَافِقُون" => "al munaafiquun",
        "اَلتَّغَابُن" => "at taghaabun",
        "اَلطَّلَاق" => "ath thalaq",
        "اَلتَّحْرِيم" => "at taHriim",
        "اَلْمُلْك" => "al mulk",
        "اَلْقَلَم" => "al qalam",
        "اَلْحَاقَّة" => "al Haqqah",
        "اَلْمَعَارِج" => "al ma'arij",
        "نُوح" => "nuuH",
        "اَلْجِن" => "al jin",
        "اَلْمُزَّمِّل" => "al muzzammil",
        "اَلْمُدَّثِّر" => "al muddatstsir",
        "اَلْقِيَامَة" => "al qiyaamah",
        "اَلْاِنْسَان" => "al insan",
        "اَلْمُرْسَلَات" => "al mursalat",
        "اَلنَّبَإ" => "an naba'",
        "اَلنَّازِعَات" => "an nazi'at",
        "عَبَسَ" => "'abasa",
        "اَلتَّكْوِير" => "at takwiir",
        "اَلْإِنْفِطَار" => "al infithar",
        "اَلْمُطَفِّفِين" => "al muthaffifiin",
        "اَلْإِنْشِقَاق" => "al insyiqaq",
        "اَلْبُرُوج" => "al buruuj",
        "اَلطَّارِق" => "ath thariq",
        "اَلْأَعْلَى" => "al a'laa",
        "اَلْغَاشِيَة" => "al ghaasyiyah",
        "اَلْفَجْر" => "al fajr",
        "اَلْبَلَد" => "al balad",
        "اَلشَّمْس" => "asy syams",
        "اَلْلَيْل" => "al layl",
        "اَلضُّحَى" => "adh dhuHaa",
        "اَلْاِنْشِرَاح" => "al insyiraH",
        "اَلتِّين" => "at tiin",
        "اَلْعَلَق" => "al 'alaq",
        "اَلْقَدْر" => "al qadr",
        "اَلْبَيِّنَة" => "al bayyinah",
        "اَلزَّلْزَلَة" => "az zalzalah",
        "اَلْعَادِيَات" => "al 'aadiyat",
        "اَلْقَارِعَة" => "al qaari'ah",
        "اَلتَّكَاثُر" => "at takaatsur",
        "اَلْعَصْر" => "al 'ashr",
        "اَلْهُمَزَة" => "al humazah",
        "اَلْفِيل" => "al fiil",
        "قُرَيْش" => "quraysy",
        "اَلْمَاعُون" => "al ma'uun",
        "اَلْكَوْثَر" => "al kawtsar",
        "اَلْكَافِرُون" => "al kafiruun",
        "اَلنَّصْر" => "an nashr",
        "اَلْلَهَب" => "al lahab",
        "اَلْإِخْلَاص" => "al ikhlash",
        "اَلْفَلَق" => "al falaq",
        "اَلنَّاس" => "an nas",
    ];
}
